



var characters = ['A','E','K','M','O','T','Б','Г','Д','ё','Ж','П','Ф','И','й','Л','Ц','Ш','Щ','Э','Ю','Я','В','З', 'あ','い','う','え','お','か','き','く','け','こ','さ','し','す','せ','そ','た','ち','つ','て','と','な','に','ぬ','ね','の','は','ひ','ふ','へ', '電','買','車','紅','無','東','馬','風','愛','時','鳥','島','語','頭','魚','園','紙','書','見','假','佛','德','拜','黑','冰','兔','妒','每','壤','步','巢','惠','莓','圓','聽','實','證','龍','賣','龜','藝','戰','繩','繪','鐵','圖', 'औ','ख','ग','घ','च','छ','ज','झ','ञ','ट','ठ','ड','ढ','ण','त','थ','द','ध','न','प','फ','ब','भ','म','य','र','ल','व','श','ष','स','ह', 'ă','â','î','ș','ț','ą','ć','ę','ł','ń','ó','ś','ź','ż','ú','æ','ú','þ','ö','ð','ä','ö','ü','ß','æ','ø','å','a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z', 'ㄱ','ㄴ','ㄷ','ㄹ','ㅁ','ㅂ','ㅅ','ㅇ','ㅈ','ㅊ','ㅋ','ㅌ','ㅍ','ㅎ','ㅏ','ㅑ','ㅓ','ㅕ','ㅗ','ㅛ','ㅜ','ㅠ','ㅡ','ㅣ','á','â','ã','à','ç','é','ê','í','ó','ô','õ','ú','ç','û','ê','œu','ï','î']

console.log(characters.length);


canvas = document.getElementById('canvas');
context = canvas.getContext('2d');

context.font = "50px Courier";
context.fillStyle = "rgba(0, 0, 0)";

var fontSize = 50;
var width = 32;
var height = 32;




for (var i =0; i < height; i++){

  for (var j=0; j < width; j++){

     var ran = Math.floor(Math.random() * characters.length);
     context.fillText(characters[ran], height + i*fontSize , width + j*fontSize);

  }
}
